alplabai/gd32-bridge-firmware/hal/gd32/adc.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * GD32G5x3 bridge HAL backend -- single-shot ADC.
 * Split move-only from hal/bridge_hw_gd32.c (fw v0.2.8); see
 * hal/gd32/init.c for the backend-wide implementation notes.
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "bridge_hw.h"
#include "gd32g5x3.h"

#include "bridge_critical.h"
#include "gd32_common.h"

/* ----------------------------------------------------------------- */
/* ADC channels.                                                      */
/* ----------------------------------------------------------------- */

/* E1M ADC0..7 -> (ADC peripheral, channel index, pad).  Sourced from
 * maintainer-confirmed `metadata/e1m_modules/v2n/gd32-io-mcu-map.tsv`
 * with channel + peripheral assignments cross-checked against the
 * GD32G553xx datasheet pin alt-function summary:
 *
 *   E1M ADC0  PD9   ADC3  CH12
 *   E1M ADC1  PB12  ADC3  CH2
 *   E1M ADC2  PE13  ADC2  CH2
 *   E1M ADC3  PE11  ADC2  CH13
 *   E1M ADC4  PC4   ADC1  CH4
 *   E1M ADC5  PA5   ADC1  CH12
 *   E1M ADC6  PA2   ADC0  CH2
 *   E1M ADC7  PA3   ADC0  CH3
 *
 * All four ADC peripherals carry two of the eight channels; the
 * init loop brings up each ADC once and the read body reconfigures
 * the routine channel + triggers a single conversion on demand. */

const gd32_adc_ch_t adc_channels_map[] = {
	[0] = { ADC3, ADC_CHANNEL_12, GPIOD, GPIO_PIN_9 },
	[1] = { ADC3, ADC_CHANNEL_2, GPIOB, GPIO_PIN_12 },
	[2] = { ADC2, ADC_CHANNEL_2, GPIOE, GPIO_PIN_13 },
	[3] = { ADC2, ADC_CHANNEL_13, GPIOE, GPIO_PIN_11 },
	[4] = { ADC1, ADC_CHANNEL_4, GPIOC, GPIO_PIN_4 },
	[5] = { ADC1, ADC_CHANNEL_12, GPIOA, GPIO_PIN_5 },
	[6] = { ADC0, ADC_CHANNEL_2, GPIOA, GPIO_PIN_2 },
	[7] = { ADC0, ADC_CHANNEL_3, GPIOA, GPIO_PIN_3 },
};
_Static_assert(sizeof(adc_channels_map) / sizeof(adc_channels_map[0]) == ADC_CHANNEL_MAP_COUNT,
               "adc_channels_map size must match ADC_CHANNEL_MAP_COUNT");

/* Per-channel sticky conversion-format overrides applied by
 * bridge_hw_adc_configure.  All three are pure caches: configure
 * validates + stores, and the read / stream-begin paths program them
 * into the converter (inside the ADCON==0 window DRES/OVSAMPCTL
 * require).  Defaults: 240 sample cycles, 12-bit resolution, no
 * oversampling.  Zero-initialised at boot, so bridge_hw_init's ADC
 * bring-up loop (init.c) seeds the non-zero defaults. */
uint16_t adc_sample_cycles_cache[8];
uint8_t  adc_resolution_bits_cache[8];
uint16_t adc_oversample_ratio_cache[8];

/* Resolution bits (12/10/8/6) -> ADC_RESOLUTION_* register value.
 * Returns false for any other width so bridge_hw_adc_configure can
 * reject it as NOSUPPORT rather than silently clamping. */
static bool adc_resolution_reg(uint8_t bits, uint32_t *reg_out)
{
	switch (bits) {
	case 12u:
		*reg_out = ADC_RESOLUTION_12B;
		return true;
	case 10u:
		*reg_out = ADC_RESOLUTION_10B;
		return true;
	case 8u:
		*reg_out = ADC_RESOLUTION_8B;
		return true;
	case 6u:
		*reg_out = ADC_RESOLUTION_6B;
		return true;
	default:
		return false;
	}
}

/* Right-aligned code range for a resolution: (1<<bits)-1.  Used by
 * both read paths to scale a code to millivolts.  Unknown widths fall
 * back to the 12-bit range (they never reach here -- configure gates
 * them -- but the mv math must not divide by a bogus value). */
uint16_t adc_full_scale_for_bits(uint8_t bits)
{
	switch (bits) {
	case 10u:
		return 1023u;
	case 8u:
		return 255u;
	case 6u:
		return 63u;
	default:
		return ADC_FULL_SCALE; /* 12-bit */
	}
}

/* Oversample ratio -> (OVSR register value, OVSS shift enum).  The
 * wire contract (docs/gd32-bridge-protocol.md §3.9) rounds a caller's
 * ratio DOWN to the nearest power of two in 1..256: 0 or 1 means "no
 * oversampling", and any value >1 is floored to 2^n.  The GD32 OVSR
 * field is the conversion count minus one, and a matching right-shift
 * of log2(ratio) normalises the accumulator back to the selected
 * resolution's full-scale (sum of `ratio` codes each <= full_scale,
 * shifted right by log2(ratio), is again <= full_scale) -- so the mv
 * math divides by the resolution's full-scale regardless of ratio.
 * enable_out == false tells the caller to disable the mode rather than
 * program a 1x accumulator. */
static void
adc_oversample_params(uint16_t ratio, bool *enable_out, uint16_t *ovsr_out, uint32_t *shift_out)
{
	if (ratio <= 1u) {
		*enable_out = false;
		return;
	}
	if (ratio > ADC_OVERSAMPLE_RATIO_MAX) ratio = ADC_OVERSAMPLE_RATIO_MAX;
	/* Largest power of two <= ratio, with its exponent. */
	uint32_t log2 = 0u;
	uint16_t pow2 = 1u;
	while ((uint16_t)(pow2 << 1) <= ratio) {
		pow2 <<= 1;
		++log2;
	}
	*enable_out = true;
	*ovsr_out   = (uint16_t)(pow2 - 1u);
	*shift_out  = OVSCR_OVSS(log2); /* ADC_OVERSAMPLING_SHIFT_<log2>B */
}

/* The oversample ratio the HARDWARE actually runs for a channel: the
 * cache floored to a power of two in [1, ADC_OVERSAMPLE_RATIO_MAX], which
 * is what adc_oversample_params programs.  One helper so the residency
 * budget (#135) and the EOC timeout bound cannot drift apart from each
 * other or from the register value -- the EOC bound previously scaled by
 * the CLAMPED cache rather than the floored one, so a ratio of 200 sized
 * its bound for 200 while the converter ran 128. */
static uint16_t adc_effective_ratio(uint8_t channel)
{
	bool     enable = false;
	uint16_t ovsr   = 0u;
	uint32_t shift  = 0u;

	adc_oversample_params(adc_oversample_ratio_cache[channel], &enable, &ovsr, &shift);
	return enable ? (uint16_t)(ovsr + 1u) : 1u;
}

/* Program a channel's cached resolution + oversample into its ADC.
 * The caller MUST have the converter disabled (DRES lives in CTL0 and
 * OVSAMPCTL only latches with ADCON==0 -- the vendor's own
 * ADC3_resolution_oversample example brackets every change with
 * adc_disable/adc_enable).  Shared by the single-shot read (which
 * wraps it in a disable/enable/tSTAB) and stream_begin (already inside
 * its own disable..enable window).  That disable/enable bracket is
 * also an ADCON power-off/on: both callers must recalibrate
 * (adc_calibrate_bounded) after their tSTAB dwell, not just re-apply
 * the format -- the calibration factor does not survive it (#34). */
void adc_apply_conv_format(uint32_t periph, uint8_t channel)
{
	uint32_t res_reg;
	if (adc_resolution_reg(adc_resolution_bits_cache[channel], &res_reg)) {
		adc_resolution_config(periph, res_reg);
	}

	bool     ovs_en;
	uint16_t ovsr;
	uint32_t shift;
	adc_oversample_params(adc_oversample_ratio_cache[channel], &ovs_en, &ovsr, &shift);
	if (ovs_en) {
		/* ALL_CONVERT: one trigger runs all `ratio` conversions and
		 * raises a single EOC with the shifted average -- the read
		 * loop's per-sample software trigger is unchanged. */
		adc_oversample_mode_config(periph, ADC_OVERSAMPLING_ALL_CONVERT, shift, ovsr);
		adc_oversample_mode_enable(periph);
	} else {
		adc_oversample_mode_disable(periph);
	}
}

/* Bounded reimplementation of the vendor's adc_calibration_enable().
 * The SPL body spins `while (RSTCLB)` then `while (CLB)` with NO
 * timeout -- and the calibration FSM only advances on a healthy,
 * clocked converter.  adc_periph_init() is reachable from the CS-EXTI
 * request handler (bridge_hw_adc_read's timeout self-heal and
 * bridge_hw_adc_stream_end's restore), where an unbounded spin on a
 * wedged ADC takes the WHOLE LINK down -- the exact failure class the
 * read path's own EOC bound was added to stop (silicon 2026-06-04).
 * Without the irony: the self-heal for a wedged converter must not
 * itself trust that converter to terminate a loop.  Same register
 * sequence as the vendor, same bound family as the other handler-safe
 * waits in this file; returns false if either phase never completes.
 * NOT static: adc_stream.c's stream_begin and ROVF recovery share it
 * (declared in gd32_common.h) -- every ADCON toggle needs the same
 * bounded recalibration, not just adc_periph_init's boot call. */
bool adc_calibrate_bounded(uint32_t periph)
{
	uint32_t to;

	ADC_CTL1(periph) |= (uint32_t)ADC_CTL1_RSTCLB;
	for (to = 100000u; to != 0u; --to) {
		if (RESET == (ADC_CTL1(periph) & ADC_CTL1_RSTCLB)) break;
	}
	if (to == 0u) return false;

	ADC_CTL1(periph) |= (uint32_t)ADC_CTL1_CLB;
	for (to = 100000u; to != 0u; --to) {
		if (RESET == (ADC_CTL1(periph) & ADC_CTL1_CLB)) break;
	}
	return to != 0u;
}

