alplabai/gd32-bridge-firmware/hal/gd32/adc.c
bool adc_periph_init(uint32_t periph)
{
	adc_deinit(periph);
	adc_clock_config(periph, ADC_CLK_SYNC_HCLK_DIV6);
	adc_data_alignment_config(periph, ADC_DATAALIGN_RIGHT);
	adc_channel_length_config(periph, ADC_ROUTINE_CHANNEL, 1u);
	adc_external_trigger_config(periph, ADC_ROUTINE_CHANNEL, EXTERNAL_TRIGGER_DISABLE);
	adc_enable(periph);

	/* Stabilisation + calibration.  The datasheet wants tSTAB after
     * ADCON before calibrating; a generous spin costs microseconds.
     * The bounded calibration then waits on RSTCLB/CLB -- without it
     * the converter runs uncalibrated for the whole session (linearity
     * offsets land directly in every reported millivolt).  A false
     * return means the calibration FSM never finished: the converter
     * is configured but its accuracy is unknown -- callers on the
     * request path surface that as an IO error rather than serving
     * readings from a converter in an unproven state. */
	for (volatile uint32_t stab = 0u; stab < 4096u; ++stab) {
	}
	return adc_calibrate_bounded(periph);
}

/* ---- per-converter ownership interlock (#133) ------------------------ *
 *
 * Two bridge channels ride each ADC peripheral (0/1 -> ADC3, 2/3 -> ADC2,
 * 4/5 -> ADC1, 6/7 -> ADC0), and both bridge_hw_adc_read and
 * bridge_hw_adc_stream_begin reconfigure that shared converter -- from
 * INTERRUPT context, at two different NVIC group priorities.  The only
 * mutual exclusion either had was a scan of adc_streams[].in_use, which
 * says nothing about a single-shot read in flight.
 *
 * So: an I2C-side CMD_ADC_READ(channel=6) passes the stream scan, does
 * adc_disable(ADC0), points routine rank 0 at ADC_CHANNEL_2 / PA2, emits
 * two of four samples -- and the SPI CS-EXTI handler pre-empts with
 * CMD_ADC_READ(channel=7), passes the same scan, and re-points the same
 * converter at PA3.  The I2C side resumes and reads its remaining samples
 * from THE WRONG PAD, then answers STATUS_OK.  Nothing on the wire
 * distinguishes that reading from a good one.
 *
 * The flag is claimed for the WHOLE disable/reconfigure/enable/convert
 * sequence, but interrupts are masked only across the test-and-set --
 * see bridge_critical.h on why the section must stay that short.  The
 * loser is told BRIDGE_HW_ERR_BUSY and returns immediately; nothing here
 * spins waiting for the flag, so there is no deadlock to construct even
 * though the claim can be held for milliseconds (#135). */
#define ADC_PERIPH_COUNT 4u

/* Dense slot index for the four converters.  A switch rather than
 * `channel >> 1` so the mapping does not silently follow a future
 * re-ordering of adc_channels_map[]. */
static uint8_t adc_periph_slot(uint32_t periph)
{
	switch (periph) {
	case ADC0:
		return 0u;
	case ADC1:
		return 1u;
	case ADC2:
		return 2u;
	case ADC3:
		return 3u;
	default:
		return ADC_PERIPH_COUNT; /* unreachable: adc_channels_map has no other */
	}
}

/* `volatile` is load-bearing here, unlike most of this tree: the flag is
 * written at one NVIC priority and read at another, and the compiler has
 * no reason to reload it across the claim. */
static volatile bool adc_periph_busy[ADC_PERIPH_COUNT];

/* Test-and-set.  True = the caller now owns `periph` and MUST release it
 * on every return path.  False = someone else holds it; answer BUSY. */
bool adc_periph_claim(uint32_t periph)
{
	const uint8_t slot = adc_periph_slot(periph);

	if (slot >= ADC_PERIPH_COUNT) return false;

	const uint32_t st       = bridge_irq_lock();
	const bool     free_now = !adc_periph_busy[slot];
	if (free_now) {
		adc_periph_busy[slot] = true;
	}
	bridge_irq_unlock(st);
	return free_now;
}

void adc_periph_release(uint32_t periph)
{
	const uint8_t slot = adc_periph_slot(periph);

	if (slot >= ADC_PERIPH_COUNT) return;
	/* A single aligned store; no section needed to clear it. */
	adc_periph_busy[slot] = false;
}

int bridge_hw_adc_read(uint8_t channel, uint8_t samples, uint16_t *mv)
{
	if (mv == 0) return BRIDGE_HW_ERR_INVAL;
	if (samples == 0u) return BRIDGE_HW_ERR_INVAL;
	if (channel >= ADC_CHANNEL_MAP_COUNT) return BRIDGE_HW_ERR_RANGE;
	if (!vref_ready_check()) return BRIDGE_HW_ERR_IO; /* dead reference -- fail loud */

	const gd32_adc_ch_t *ch = &adc_channels_map[channel];

	/* Converter-sharing guard, the read-side mirror of stream_begin's
     * stream-vs-stream check: two bridge channels ride each ADC
     * peripheral (ch0/1 -> ADC3, 2/3 -> ADC2, 4/5 -> ADC1, 6/7 ->
     * ADC0), and a stream owns its converter outright between BEGIN
     * and END (external-trigger + circular DMA + DDM).  A single-shot
     * read on the sibling channel would re-point routine rank 0 out
     * from under the stream's DMA, software-trigger an unpaced
     * conversion next to the pacing timer's, and consume the EOC the
     * DDM path depends on -- corrupting the live ring AND returning
     * bogus data.  Refuse honestly; the host retries after STREAM_END. */
	for (uint8_t si = 0u; si < BRIDGE_ADC_STREAM_COUNT; ++si) {
		if (adc_streams[si].in_use &&
		    adc_channels_map[adc_streams[si].channel].periph == ch->periph) {
			return BRIDGE_HW_ERR_BUSY;
		}
	}

	/* Residency budget (#135).  Bound the PRODUCT of the two host-settable
     * multipliers -- and the sample window they multiply -- against an
     * explicit ceiling on how long this may hold a transport ISR, BEFORE
     * touching the converter or claiming it.  See
     * ADC_READ_ISR_BUDGET_US in gd32_common.h for the model, the numbers
     * it is derived from, and what the current 1 ms ceiling permits.
     *
     * Rejecting here rather than capping a factor is deliberate: silently
     * halving a requested oversample ratio would return a reading whose
     * noise floor is not what the caller asked for, with STATUS_OK and no
     * way to tell. */
	const uint32_t half_cycles_per_conv =
	    (uint32_t)(2u * adc_sample_cycles_cache[channel]) + ADC_READ_CONV_HALF_CYCLES_12B;
	const uint32_t residency_half_cycles =
	    (uint32_t)samples * (uint32_t)adc_effective_ratio(channel) * half_cycles_per_conv;
	if (residency_half_cycles > ADC_READ_BUDGET_HALF_CYCLES) {
		return BRIDGE_HW_ERR_RANGE;
	}

	/* Claim the shared converter for the whole sequence below (#133).
     * The stream scan above only covers stream-vs-read; this is what
     * covers read-vs-read and read-vs-stream_begin across the CS-EXTI
     * pre-emption of I2C0_EV.  Every return path from here down must
     * release. */
	if (!adc_periph_claim(ch->periph)) return BRIDGE_HW_ERR_BUSY;

	/* Configure the routine channel for this op (each call re-applies
     * because multiple bridge channels can share an ADC peripheral -- a
     * prior bridge_hw_adc_read on a different bridge channel may have
     * pointed the routine slot elsewhere).  Sample-cycle count comes
     * from the per-channel cache so bridge_hw_adc_configure's choice
     * survives across reads.
     *
     * Resolution + oversample (also cached) must be programmed with
     * the converter DISABLED -- DRES/OVSAMPCTL only latch while
     * ADCON==0 -- so bracket the format apply in a disable/enable with
     * the same tSTAB dwell adc_periph_init uses.  Two bridge channels
     * share each converter and may hold different formats, so this
     * re-applies every read; the sibling-stream case already returned
     * BUSY above, so no live stream owns the converter here.  The
     * ADCON toggle does NOT preserve the boot calibration -- UM
     * Rev1.2 p.424 17.4.1: the calibration factor is applied "until
     * the next ADC power-off", and clearing ADCON IS that power-off
     * (p.447).  17.7 exposes no calibration-value register to save
     * and restore across the toggle, so it must be recomputed below,
     * every read (#34). */
	adc_disable(ch->periph);
	adc_apply_conv_format(ch->periph, channel);
	adc_routine_channel_config(ch->periph, 0u, ch->channel, adc_sample_cycles_cache[channel]);
	adc_enable(ch->periph);
	for (volatile uint32_t stab = 0u; stab < 4096u; ++stab) {
		/* tSTAB dwell after ADCON */
	}
	/* Recalibrate: bounded (UM Rev1.2 17.4.1 sequence, adc_calibrate_
     * bounded above), cost tCAL = 902 1/fADC (GD32G553xx Datasheet
     * Rev2.0 Table 4-35) = 25.06 us at this driver's fixed 36 MHz
     * ADC_CLK_SYNC_HCLK_DIV6 clock -- negligible next to the samples
     * loop below.  A false return means the calibration FSM never
     * finished (wedged converter); report IO rather than serve
     * readings from an unproven converter.
     *
     * DISCLOSURE (#34 review): before this PR, adc_calibrate_bounded's
     * worst case -- two phases x 100000 iterations if the RSTCLB/CLB
     * FSM is wedged, ~200000 iterations total -- mattered once, at
     * boot (adc_periph_init).  It now runs here on every CMD_ADC_READ,
     * and identically in bridge_hw_adc_stream_begin and the ROVF
     * recovery path (adc_stream.c), all three inside the priority-1
     * CS-EXTI transport ISR.  A wedged calibration FSM now costs that
     * same ~200000-iteration worst case on essentially every analog
     * request, not just once.  This is not wrong -- #34's correctness
     * fix REQUIRES recalibrating after every ADCON toggle -- but it is
     * a real, disclosed increase in worst-case ISR dwell, of the same
     * order as the EOC bound below.
     *
     * Considered shortening the bound so a wedged FSM fails faster.
     * Declined: tCAL (25.06 us, above) is a hardware-cycle figure at
     * the ADC clock, not a CPU-iteration count, and -- exactly as the
     * EOC bound's own per-iteration cost is unverified two comments
     * down (no -O flag anywhere in this repo, #26) -- there is no
     * verified conversion from tCAL to an iteration count for THIS
     * loop either.  Shortening it on a guess risks turning a
     * legitimately-slow-but-healthy calibration into a false IO
     * failure, which is a worse outcome than the bounded ~200000-
     * iteration wait: that wait is still hard-bounded (same "abort
     * latch" shape as the EOC bound), and the loop body here is a
     * plain register read/compare (no out-of-line call like
     * adc_flag_get), so it is very likely cheaper per iteration than
     * the EOC poll.  Left at the existing, already-in-service bound
     * rather than re-deriving a smaller one from a guess. */
	if (!adc_calibrate_bounded(ch->periph)) {
		/* Release the converter claim before bailing (#133 x #80) --
         * same merge-created hazard as in bridge_hw_adc_stream_begin:
         * an early return inside the claimed window would strand
         * adc_periph_busy[] set, and every later read or stream_begin on
         * this converter would answer BRIDGE_HW_ERR_BUSY until reboot. */
		adc_periph_release(ch->periph);
		return BRIDGE_HW_ERR_IO;
	}

	/* A stale EOC (e.g. the in-flight conversion that completes after
     * a stream END drops continuous mode) would satisfy the first poll
     * instantly and serve OLD data as sample 1 -- clear it so every
     * EOC we consume belongs to a conversion WE triggered. */
	adc_flag_clear(ch->periph, ADC_FLAG_EOC);

	/* Take `samples` consecutive conversions, software-triggered per
     * sample.  Polled EOC with a HARD BOUND: this body runs inside the
     * CS-EXTI handler, and an unbounded spin on a wedged ADC took the
     * WHOLE LINK down with it (silicon 2026-06-04: after an adc_stream
     * cycle the next read's EOC never came; the handler never returned,
     * the SPI RX DMA was never re-armed -- captured live with CH3
     * frozen disabled at CNT=66 -- and every subsequent command on
     * every surface failed).  The ~100k-iteration bound is the abort
     * latch; on timeout the peripheral is re-initialised (deinit +
     * reconfig + recalibrate) so the NEXT read starts from a clean
     * converter -- same self-healing shape as the TRNG fault path.
     *
     * SCALE the bound by the oversample ratio, ADDITIVELY and CAPPED
     * (#17) -- NOT `100000u * ratio`, which reaches 25 600 000
     * iterations at the 256x ceiling and, at that magnitude, turns
     * this handler-context spin into the same "whole link down"
     * failure the bound exists to prevent, just with a longer fuse.
     *
     * With oversampling ON, ONE triggered conversion is `ratio`
     * back-to-back sub-conversions before a single EOC.  At this
     * driver's fixed ADC_CLK_SYNC_HCLK_DIV6 clock (36 MHz, HCLK =
     * 216 MHz) one sub-conversion takes (sample_cycles + 12.5)
     * CK_ADC (UM Rev1.2 17.4.9, p.431): the default 240-cycle config
     * this file uses is ~7.0 us, and the slowest legal config
     * (sample_cycles clamped to 638 in bridge_hw_adc_configure) is
     * ~18.1 us.  That is HARDWARE conversion time (ADC clock cycles),
     * independent of firmware -- so a healthy oversampled read costs
     * at most ratio * 18.1 us of actual ADC dwell, ~4.6 ms at
     * ratio=256.
     *
     * THE BOUND THIS CODE ACTUALLY GUARANTEES IS AN ITERATION COUNT,
     * not a millisecond figure: 100000u base + 25000u per oversample
     * step, capped at 400000u total.  Translating that count to
     * wall-clock time depends on the EOC poll loop's per-iteration
     * cost, which is UNVERIFIED here -- disassembling this handler
     * (arm-none-eabi-gcc 13.3.1) shows adc_flag_get() compiled as an
     * out-of-line `bl` per iteration, a function call, not the
     * inlined register read a ~10-cycles/iteration estimate would
     * assume, and this repo sets no -O flag anywhere (neither
     * CMakeLists.txt nor ci.yml sets CMAKE_BUILD_TYPE, #26).  So the
     * true per-iteration cost, and therefore any millisecond figure
     * below, is plausibly several times higher than a naive estimate
     * and is NOT measured on real hardware here.
     *
     * An earlier version of this comment claimed the pre-existing
     * 100000u bound was "documented at the top of this comment block
     * as ~4.6 ms of real dwell" -- that was false: no in-file
     * measurement of this loop exists anywhere in this repo; the only
     * source for a 4.6 ms figure was an issue-body assertion, not a
     * recorded measurement.  The ~4.6 ms two paragraphs up is a math
     * estimate from the datasheet-derived HARDWARE conversion timing,
     * not a measured dwell of this polling loop, and must not be read
     * as one.
     *
     * What holds regardless of per-iteration cost: this is a hard,
     * fixed iteration ceiling -- 400000u -- so the wait is bounded no
     * matter how expensive a single iteration turns out to be, the
     * same abort-latch shape as the rest of this file's handler-safe
     * waits.  As a rough ESTIMATE only (contingent on #26, not to be
     * quoted as a fact): "tens of milliseconds" at the high end,
     * still roughly 64x fewer iterations than the old
     * `100000u * ovs_ratio` multiplicative form reached at the 256x
     * ceiling (25 600 000 iterations) -- regardless of what the true
     * per-iteration cost is.
     *
     * THE RATIO COMES FROM adc_effective_ratio() (#135), not from a
     * locally re-clamped copy of the cache.  That helper returns the
     * power-of-two the hardware ACTUALLY runs, which is also what the
     * residency budget above is computed from -- so the fault-path
     * bound here and the nominal-path budget there cannot drift apart
     * from each other or from the register value.  The previous local
     * clamp sized this bound for a requested ratio of 200 while the
     * converter ran 128.
     *
     * The two bounds now reinforce each other rather than overlap:
     * #135's ADC_READ_ISR_BUDGET_US refuses any read whose TOTAL
     * conversion time exceeds ~1 ms before the converter is touched, so
     * every read that reaches this loop is a short one and this ceiling
     * can only ever fire on a genuinely wedged converter -- which is
     * exactly what #17 wanted it to mean.  400000u is comfortably above
     * every configuration the budget still permits (the widest is 256x
     * oversampling at the 2-cycle minimum window, ~103 us per triggered
     * conversion). */
	uint32_t eoc_bound = 100000u + 25000u * (uint32_t)adc_effective_ratio(channel);
	if (eoc_bound > 400000u) eoc_bound = 400000u;
	for (uint8_t i = 0; i < samples; ++i) {
		adc_software_trigger_enable(ch->periph, ADC_ROUTINE_CHANNEL);
		uint32_t to = eoc_bound;
		while (!adc_flag_get(ch->periph, ADC_FLAG_EOC) && --to) {
			/* spin, bounded */
		}
		if (to == 0u) {
			/* Self-heal is best-effort: the re-init's calibration is
             * itself bounded (a wedged converter must not convert a
             * read timeout into a link wedge), and this path already
             * reports IO either way.  Release AFTER the re-init so no
             * pre-empting claimant sees a half-reinitialised converter
             * (#133). */
			(void)adc_periph_init(ch->periph);
			adc_periph_release(ch->periph);
			return BRIDGE_HW_ERR_IO;
		}
		adc_flag_clear(ch->periph, ADC_FLAG_EOC);
		uint32_t code = adc_routine_data_read(ch->periph);
		/* Scale by the channel's cached resolution, not a fixed 4095:
		 * a 10/8/6-bit conversion (or an oversampled result, which the
		 * shift normalises back to the same range) tops out below 4095. */
		const uint16_t fs = adc_full_scale_for_bits(adc_resolution_bits_cache[channel]);
		if (code > fs) code = fs;
		mv[i] = (uint16_t)((code * ADC_VREF_MV) / fs);
	}
	adc_periph_release(ch->periph);
	return BRIDGE_HW_OK;
}

int bridge_hw_adc_configure(uint8_t  channel,
                            uint16_t oversample_ratio,
                            uint16_t sample_cycles,
                            uint8_t  resolution_bits)
{
	if (channel >= ADC_CHANNEL_MAP_COUNT) return BRIDGE_HW_ERR_RANGE;

	/* Validate resolution BEFORE mutating any cache so a rejected field
	 * leaves the channel's format untouched.  All three fields are
	 * pure-cache here (like sample_cycles): the read / stream_begin
	 * paths program them into the converter inside their ADCON==0
	 * windows.  Deferring the register write also keeps configure from
	 * disturbing a converter that a sibling channel may be streaming
	 * on -- the new format takes effect on this channel's next read or
	 * stream_begin.
	 *
	 * Field semantics follow the wire contract (docs/gd32-bridge-
	 * protocol.md §3.9):
	 *   resolution_bits: 0 -> default (12).  6/8/10/12 map to the
	 *     hardware DRES field.  14/16 are effective-resolution modes
	 *     that the GD32 can only reach by under-shifting an oversampled
	 *     accumulator (DRES tops out at 12 bit); that extension is not
	 *     implemented yet -> NOSUPPORT.  Any other width is invalid ->
	 *     INVAL.
	 *   oversample_ratio: 0/1 -> off; anything larger is floored to the
	 *     nearest power of two in 2..256 (adc_oversample_params, never
	 *     rejects -- matches the doc's "rounds down" wording).
	 * The stored resolution is normalised to 12 when 0 so the read
	 * path's full-scale lookup and register apply see a concrete
	 * width. */
	uint8_t  res_bits = (resolution_bits == 0u) ? ADC_RES_BITS_DEFAULT : resolution_bits;
	uint32_t res_reg;
	if (!adc_resolution_reg(res_bits, &res_reg)) {
		if (res_bits == 14u || res_bits == 16u) return BRIDGE_HW_ERR_NOTIMPL;
		return BRIDGE_HW_ERR_INVAL;
	}

	/* Sample cycles: 0 means "firmware default" (per the wire contract),
     * NOT the fastest window -- collapsing 240 -> 2 cycles on the
     * high-impedance divider inputs the default exists to serve would
     * leave the S/H cap unsettled and read systematically low (worse
     * still under oversampling).  Any non-zero value is a direct cycle
     * count clamped into the vendor's accepted 2..638 range (per
     * `adc_routine_channel_config`'s sample_time parameter). */
	uint16_t sc = (sample_cycles == 0u) ? ADC_DEFAULT_SAMPLE_CYCLES : sample_cycles;
	if (sc < 2u) sc = 2u;
	if (sc > 638u) sc = 638u;

	adc_sample_cycles_cache[channel]    = sc;
	adc_resolution_bits_cache[channel]  = res_bits;         /* 0 normalised to 12 above */
	adc_oversample_ratio_cache[channel] = oversample_ratio; /* apply-time floors to pow2 */
	return BRIDGE_HW_OK;
}
